{
    "lesson": "https://platzi.com/clases/python/concepto/basicos-de-programacion/guia-de-python/material/",
    "title": "Guía de instalación y conceptos básicos",
    "user": "Arturo Jamaica",
    "text": "¿Qué es Python?\n\nPython es un lenguaje de programación creado por Guido Van Rossum, con una sintaxis muy limpia, ideado para enseñar a la gente a programar bien. Se trata de un lenguaje interpretado o de script.\nVentajas:\n\n    Legible: sintaxis intuitiva y estricta.\n    Productivo: ahorra mucho código.\n    Portable: para todo sistema operativo.\n    Recargado: viene con muchas librerías por defecto.\n\nEditor recomendado: Atom o Sublime Text.\nInstalación\n\nExisten dos versiones de Python que tienen gran uso actualmente, Python 2.x y Python 3.x, para este curso puedes utilizar cualquiera de las dos, pero te recomendamos usar una versión 3.x\n\nPara instalar Python solo debes seguir los pasos dependiendo del sistema operativo que tengas instalado.\nWindows\n\nPara instalarlo en Windows, debemos ir a https://www.python.org/downloads/ el sitio reconocerá el sistema operativo y te dará las opciones para descargar.\n\nEjecuta el archivo que descargaste y sigue los pasos de instalación. Al finalizar vas a poder utilizar Python en tu computador y estás listo para continuar con el curso.\nMacOS\n\nLa forma sencilla es tener instalado homebrew y usar el comando:\n\n** Para instalar la Versión 2.7**\n\nbrew install python\n\nPara instalar la Versión 3.x\n\nbrew install python3\n\nLinux\n\nGeneralmente Linux ya lo trae instalado, para comprobarlo puedes ejecutar en la terminal el comando\n\nVersión 2.7\n\npython -v\n\nVersión 3.x\n\npython3 -v\n\nSi el comando arroja un error quiere decir que no lo tienes instalado, en ese caso los pasos para instalarlo cambian un poco de acuerdo con la distribución de linux que estés usando. Generalmente el gestor de paquetes de la distribución de Linux tiene el paquete de Python\n\nSi eres usuario de Ubuntu o Debian por ejemplo puedes usar este comando para instalar la versión 3.1:\n\n$ sudo apt-get install python3.1\n\nSi eres usuario de Red Hat o Centos por ejemplo puedes usar este comando para instalar python\n\n$ sudo yum install python\n\nSi usas otra distribución o no has podido instalar python en tu sistema Linux dejame un comentario y vemos tu caso específico.\n\nSi eres usuario habitual de linux también puedes descargar los archivos para instalarlo manualmente.\nAntes de empezar:\n\nPara usar Python debemos tener un editor de texto abierto y una terminal o cmd (línea de comandos en Windows) como administrador.\n\nNo le tengas miedo a la consola, la consola es tu amiga.\n\nPara ejecutar Python abres la terminal y escribes:\n\n $ python\n\nTe abrirá una consola de Python, lo notarás porque el prompt cambia y ahora te muestra tres simbolos de mayor que “ >>> “ y el puntero adelante indicando que puedes empezar a ingresar comandos de python.\n\n >>> \n\nEn éste modo puedes usar todos los comandos de Python o escribir código directamente.\n\n*Si deseas ejecutar código de un archivo sólo debes guardarlo con extension.py y luego ejecutar en la terminal:\n\n $ python archivo.py\n\nTen en cuenta que para ejecutar el archivo con extensión “.py” debes estar ubicado en el directorio donde tienes guardado el archivo.\n\nCuando usamos Python debemos atender ciertas reglas de la comunidad para definir su estructura. Las encuentras en el libro PEP8.\nTipos de datos en Python\n\n    Enteros (int): en este grupo están todos los números, enteros y long:\n\nejemplo: 1, 2.3, 2121, 2192, -123\n\n    Booleanos (bool): Son los valores falso o verdadero, compatibles con todas las operaciones booleanas ( and, not, or ):\n\nejemplo: True, False\n\n    Cadenas (str): Son una cadena de texto :\n\nejemplos: “Hola”, “¿Cómo estas?”\n\n    Listas: Son un grupo o array de datos, puede contener cualquiera de los datos anteriores:\n\nejemplos: [1,2,3, ”hola” , [1,2,3] ], [1,“Hola”,True ]\n\n    Diccionarios: Son un grupo de datos que se acceden a partir de una clave:\n\nejemplo: {“clave”:”valor”}, {“nombre”:”Fernando”}\n\n    Tuplas: también son un grupo de datos igual que una lista con la diferencia que una tupla después de creada no se puede modificar.\n\nejemplos: [1,2,3, ”hola” , [1,2,3] ], [1,“Hola”,True ] (Pero jamás podremos cambiar los elementos dentro de esa Tupla)\n\nEn Python trabajas con módulos y ficheros que usas para importar las librerías.\nFunciones\n\nLas funciones las defines con def junto a un nombre y unos paréntesis que reciben los parámetros a usar. Terminas con dos puntos.\n\ndef nombre_de_la_función(parametros):\n\nDespués por indentación colocas los datos que se ejecutarán desde la función:\n\n >>> def my_first_function():\n ...   return “Hello World!” \n ...    \n >>> my_first_function()\n\nHello World!\nVariables\n\nLas variables, a diferencia de los demás lenguajes de programación, no debes definirlas, ni tampoco su tipo de dato, ya que al momento de iterarlas se identificará su tipo. Recuerda que en Python todo es un objeto.\n\n A = 3 \n B = A\n\nListas\n\nLas listas las declaras con corchetes. Estas pueden tener una lista dentro o cualquier tipo de dato.\n\n >>> L = [22, True, ”una lista”, [1, 2]] \n >>> L[0] \n 22\n\nTuplas\n\nLas tuplas se declaran con paréntesis, recuerda que no puedes editar los datos de una tupla después de que la has creado.\n\n >>> T = (22, True, "una tupla", (1, 2)) \n >>> T[0] \n 22\n\nDiccionarios\n\nEn los diccionarios tienes un grupo de datos con un formato: la primera cadena o número será la clave para acceder al segundo dato, el segundo dato será el dato al cual accederás con la llave. Recuerda que los diccionarios son listas de llave:valor.\n\n >>> D = {"Kill Bill": "Tamarino", "Amelie": "Jean-Pierre Jeunet"} \n >>> D["Kill Bill"]\n "Tamarino"\n\nConversiones\n\nDe flotante a entero:\n\n >>> int(4.3)\n 4\n\nDe entero a flotante:\n\n >>> float(4) \n 4.0\n\nDe entero a string:\n\n >>> str(4.3) \n "4.3"\n\nDe tupla a lista:\n\n >>> list((4, 5, 2)) \n [4, 5, 2]\n\nOperadores Comunes\n\nLongitud de una cadena, lista, tupla, etc.:\n\n >>> len("key") \n 3\n\nTipo de dato:\n\n >>> type(4) \n < type int >\n\nAplicar una conversión a un conjunto como una lista:\n\n >>> map(str, [1, 2, 3, 4])\n ['1', '2', '3', '4']\n\nRedondear un flotante con x número de decimales:\n\n>>> round(6.3243, 1)\n 6.3\n\nGenerar un rango en una lista (esto es mágico):\n\n >>> range(5) \n [0, 1, 2, 3, 4]\n\nSumar un conjunto:\n\n >>> sum([1, 2, 4]) \n 7\n\nOrganizar un conjunto:\n\n >>> sorted([5, 2, 1]) \n [1, 2, 5]\n\nConocer los comandos que le puedes aplicar a x tipo de datos:\n\n >>>Li = [5, 2, 1]\n >>>dir(Li)\n >>>['append', 'count', 'extend', 'index', 'insert', 'pop', 'remove', 'reverse', 'sort']\n \n\n‘append’, ‘count’, ‘extend’, ‘index’, ‘insert’, ‘pop’, ‘remove’, ‘reverse’, ‘sort’ son posibles comandos que puedes aplicar a una lista.\n\nInformación sobre una función o librería:\n\n >>> help(sorted) \n (Aparecerá la documentación de la función sorted)\n\nClases\n\nClases es uno de los conceptos con más definiciones en la programación, pero en resumen sólo son la representación de un objeto. Para definir la clase usas_ class_ y el nombre. En caso de tener parámetros los pones entre paréntesis.\n\nPara crear un constructor haces una función dentro de la clase con el nombre init y de parámetros self (significa su clase misma), nombre_r y edad_r:\n\n >>> class Estudiante(object): \n ...     def __init__(self,nombre_r,edad_r): \n ...      self.nombre = nombre_r \n ...       self.edad = edad_r \n ...\n ...     def hola(self): \n ...      return "Mi nombre es %s y tengo %i" % (self.nombre, self.edad) \n ... \n >>> e = Estudiante(“Arturo”, 21) \n >>> print e.hola() \n Mi nombre es Arturo y tengo 21\n\nLo que hicimos en las dos últimas líneas fue:\n\n1. En la variable e llamamos la clase Estudiante y le pasamos la cadena “Arturo” y el entero 21.\n\n2. Imprimimos la función hola() dentro de la variable e (a la que anteriormente habíamos pasado la clase).\n\nY por eso se imprime la cadena “Mi nombre es Arturo y tengo 21”\nMétodos especiales\n\ncmp(self,otro)\nMétodo llamado cuando utilizas los operadores de comparación para comprobar si tu objeto es menor, mayor o igual al objeto pasado como parámetro.\n\nlen(self)\nMétodo llamado para comprobar la longitud del objeto. Lo usas, por ejemplo, cuando llamas la función len(obj) sobre nuestro código. Como es de suponer el método te debe devolver la longitud del objeto.\n\ninit(self,otro)\nEs un constructor de nuestra clase, es decir, es un “método especial” que es llamas automáticamente cuando creas un objeto.\nCondicionales IF\n\nLos condicionales tienen la siguiente estructura. Ten en cuenta que lo que contiene los paréntesis es la comparación que debe cumplir para que los elementos se cumplan.\n\n if ( a > b ):\n  elementos \n elif ( a == b ): \n    elementos \n else:\n    elementos\n\nBucle FOR\n\nEl bucle de for lo puedes usar de la siguiente forma: recorres una cadena o lista a la cual va a tomar el elemento en cuestión con la siguiente estructura:\n\n for i in ____:\n  elementos\n\nEjemplo:\n\n for i in range(10):\n     print i\n\nEn este caso recorrerá una lista de diez elementos, es decir el _print i _de ejecutar diez veces. Ahora i va a tomar cada valor de la lista, entonces este for imprimirá los números del 0 al 9 (recordar que en un range vas hasta el número puesto -1).\nBucle WHILE\n\nEn este caso while tiene una condición que determina hasta cuándo se ejecutará. O sea que dejará de ejecutarse en el momento en que la condición deje de ser cierta. La estructura de un while es la siguiente:\n\n while (condición):\n   elementos\n\nEjemplo:\n\n >>> x = 0 \n >>> while x < 10: \n ...     print x \n ...  x += 1\n\nEn este ejemplo preguntará si es menor que diez. Dado que es menor imprimirá x y luego sumará una unidad a x. Luego x es 1 y como sigue siendo menor a diez se seguirá ejecutando, y así sucesivamente hasta que x llegue a ser mayor o igual a 10.\nCómo seguir\n\nNo te preocupes si en este punto no entiendes algunos de estos conceptos, sigue con el curso donde vamos a realizar ejercicios que te ayuden a comprender y poder aplicar cada una de las características de Python.\n\nAdelante!"
}